// 1. Запросіть у користувача його вік та визначіть, ким він є: дитиною (0–12), підлітком (12–18), дорослим (18–60) або пенсіонером (60– ...).
// 2. Запросіть у користувача число від 0 до 9 і виведіть йому спеціальний символ, який розташований на цій клавіші (1–!, 2–@, 3–# тощо).
// 3. Запросіть у користувача тризначне число та перевірте чи є в ньому однакові цифри.
// 4. Запросіть у користувача рік та перевірте чи є він високо- сним. Високосний рік або кратний 400, або кратний 4 і при цьому не кратний 100.
// 5. Запросіть у користувача п’ятирозрядне число і визначте, чи є воно паліндромом.
// 6. Напишіть конвертор валют. Користувач вводить кількість USD, вибирає в яку валюту хоче перекласти: EUR, UAN або AZN, і отримує відповідну суму.